-- ////////////////////////////////////////////////////////////////////////////
-- ///
-- //
-- /
--      ロード時のテーブル設定
--                                                                            /
--                                                                           //
--                                                                          ///
-- ////////////////////////////////////////////////////////////////////////////

-- stage(_G.stage)は初期化しないこと！(直前にWorldRule.luaのrule.QuestInit()で初期化しているため)
_G.stage_info = {}

-- ////////////////////////////////////////////////////////////////////////////
-- ///
-- //
-- /
--      説明,ヒント,解答など
--                                                                            /
--                                                                           //
--                                                                          ///
-- ////////////////////////////////////////////////////////////////////////////

stage_info._0_Title = "Stage03 左に進めるなら左を向く"

stage_info._1_StageRule = {
    "Walkerの行動可能回数は5",
    __rgui_folder_default_open = true,
}

stage_info._2_Hint = { '左に進めるなら左を向く' }
stage_info._3_Hint = { 'でも、さっき左に曲がったとこであればしない' }
stage_info._4_Hint = { '左に進める ＆ さっき左に曲がったのではない ⇒ ならば,左に曲がる' }
stage_info._5_Hint = { '左に進める(すぐ左に壁が無い)\n  map:CanEnter(-1, 0)' }
stage_info._6_Hint = { 'さっき左に曲がったのではない\n  his.prev_action ~= "TurnLeft"' }
stage_info._7_Hint = { 'ifの条件を「＆」で記述するときは "and" で繋ぐ' }


-- ////////////////////////////////////////////////////////////////////////////
-- ///
-- //
-- /
--      ホストからCallされる関数
--                                                                            /
--                                                                           //
--                                                                          ///
-- ////////////////////////////////////////////////////////////////////////////

-- ============================================================================
-- 迷路生成
--
-- 戻り値 : true .... 正常終了(迷路ができたよ！遊べるかは知らんけど！)
--          false ... 異常終了
--
-- ※ホストからはプレイできる迷路が生成されているかどうかの判定を行っていない
--
stage.GenerateMaze = function(_seed)
    stage.maze.map = {
        "###  ",
        "#D#  ",
        "#.###",
        "#...#",
        "###.#",
        "  #.#",
        "  ###"
    }

    cs.walker:SetPos(3, 5, 0)

    walker.state.life = 5

    return true
end


-- ////////////////////////////////////////////////////////////////////////////
-- ///
-- //
-- /
--      内部関数
--                                                                            /
--                                                                           //
--                                                                          ///
-- ////////////////////////////////////////////////////////////////////////////
