-- ////////////////////////////////////////////////////////////////////////////
-- ///
-- //
-- /
--      ロード時のテーブル設定
--                                                                            /
--                                                                           //
--                                                                          ///
-- ////////////////////////////////////////////////////////////////////////////

local GenMaze = import("Lib/GenMaze.lua")

-- stage(_G.stage)は初期化しないこと！(直前にWorldRule.luaのrule.QuestInit()で初期化しているため)
_G.stage_info = {}

-- ////////////////////////////////////////////////////////////////////////////
-- ///
-- //
-- /
--      説明,ヒント,解答など
--                                                                            /
--                                                                           //
--                                                                          ///
-- ////////////////////////////////////////////////////////////////////////////

stage_info._0_Title = "Stage04 敵を倒す"

stage_info._1_StageRule = {
    "Walkerの行動可能は7",
    __rgui_folder_default_open = true,
}

stage_info._2_Hint = { '銃の効果は2歩分先まで届く' }
stage_info._3_Hint = { '銃を使う条件\n  ⇒「銃を持っている」かつ「1歩先か2歩先に敵がいる」' }
stage_info._4_Hint = { '「1歩先か2歩先に敵がいる」\n  ⇒「1歩先に敵がいる」または「2歩先に敵がいる」' }

-- ////////////////////////////////////////////////////////////////////////////
-- ///
-- //
-- /
--      ホストからCallされる関数
--                                                                            /
--                                                                           //
--                                                                          ///
-- ////////////////////////////////////////////////////////////////////////////

-- ============================================================================
-- 迷路生成
--
-- 戻り値 : true .... 正常終了(迷路ができたよ！遊べるかは知らんけど！)
--          false ... 異常終了
--
-- ※ホストからはプレイできる迷路が生成されているかどうかの判定を行っていない
--
stage.GenerateMaze = function(_seed)
    stage.maze.map = {
        "###",
        "#D#",
        "#.#",
        "#1#",
        "#.#",
        "#0#",
        "#.#",
        "#g#",
        "#.#",
        "#.#",
        "###",
    }

    cs.walker:SetPos(1, 9, 0)
    walker.state.life = 7

    return true
end


-- ////////////////////////////////////////////////////////////////////////////
-- ///
-- //
-- /
--      内部関数
--                                                                            /
--                                                                           //
--                                                                          ///
-- ////////////////////////////////////////////////////////////////////////////
