-- ////////////////////////////////////////////////////////////////////////////
-- ///
-- //
-- /
--      ロード時のテーブル設定
--                                                                            /
--                                                                           //
--                                                                          ///
-- ////////////////////////////////////////////////////////////////////////////

local GenMaze = import("Lib/GenMaze.lua")

-- stage(_G.stage)は初期化しないこと！(直前にWorldRule.luaのrule.QuestInit()で初期化しているため)
_G.stage_info = {}

-- ////////////////////////////////////////////////////////////////////////////
-- ///
-- //
-- /
--      説明,ヒント,解答など
--                                                                            /
--                                                                           //
--                                                                          ///
-- ////////////////////////////////////////////////////////////////////////////

stage_info._0_Title = "Stage02 開かない出口"

stage_info._1_StageRule = {
    "Walkerの行動可能は13",
    __rgui_folder_default_open = true,
}

stage_info._2_Hint = { '「出口が開錠できなかった」状況になったということは\n  ⇒ 「さっき鍵を使ったのに今も鍵を持っている」状況が発生している' }
stage_info._3_Hint = { 'さっきの行動で鍵を使った\n  his.prev_object == "Key"' }
stage_info._4_Hint = { '鍵を使う条件は以下の3つが成立すること\n  「出口(施錠)にいる」「鍵を持っている」「さっきの行動で鍵を使って*いない*」' }

-- ////////////////////////////////////////////////////////////////////////////
-- ///
-- //
-- /
--      ホストからCallされる関数
--                                                                            /
--                                                                           //
--                                                                          ///
-- ////////////////////////////////////////////////////////////////////////////

-- ============================================================================
-- 迷路生成
--
-- 戻り値 : true .... 正常終了(迷路ができたよ！遊べるかは知らんけど！)
--          false ... 異常終了
--
-- ※ホストからはプレイできる迷路が生成されているかどうかの判定を行っていない
--
stage.GenerateMaze = function(_seed)
    stage.maze.map = {
        "###",
        "#o#",
        "#.#",
        "#l#",
        "#.#",
        "#$#",
        "#.#",
        "#k#",
        "#.#",
        "#.#",
        "###",
    }

    cs.walker:SetPos(1, 9, 0)
    walker.state.life = 13

    return true
end


-- ////////////////////////////////////////////////////////////////////////////
-- ///
-- //
-- /
--      内部関数
--                                                                            /
--                                                                           //
--                                                                          ///
-- ////////////////////////////////////////////////////////////////////////////
