-- ////////////////////////////////////////////////////////////////////////////
-- ///
-- //
-- /
--      ロード時のテーブル設定
--                                                                            /
--                                                                           //
--                                                                          ///
-- ////////////////////////////////////////////////////////////////////////////

local GenMaze = import("Lib/GenMaze.lua")

-- stage(_G.stage)は初期化しないこと！(直前にWorldRule.luaのrule.QuestInit()で初期化しているため)
_G.stage_info = {}

-- ////////////////////////////////////////////////////////////////////////////
-- ///
-- //
-- /
--      説明,ヒント,解答など
--                                                                            /
--                                                                           //
--                                                                          ///
-- ////////////////////////////////////////////////////////////////////////////

stage_info._0_Title = "Stage06 銃の有無で敵への対応を変えられるか？"

stage_info._1_StageRule = {
    "Walkerの行動可能回数は7",
    __rgui_folder_default_open = true,
}

stage_info._2_Hint = { '左を向く判定で...\n  「銃を持っている」なら「左に敵がいない(いても倒せる)」ことになる' }
stage_info._3_Hint = { '"左を向いた" 後に "敵を倒す" と、his.prev_action が "UseItem" になる' }
stage_info._4_Hint = { '「最後にとった移動行動」\n  ⇒ his.last_move_action' }

-- ////////////////////////////////////////////////////////////////////////////
-- ///
-- //
-- /
--      ホストからCallされる関数
--                                                                            /
--                                                                           //
--                                                                          ///
-- ////////////////////////////////////////////////////////////////////////////

-- ============================================================================
-- 迷路生成
--
-- 戻り値 : true .... 正常終了(迷路ができたよ！遊べるかは知らんけど！)
--          false ... 異常終了
--
-- ※ホストからはプレイできる迷路が生成されているかどうかの判定を行っていない
--
stage.GenerateMaze = function(_seed)
    stage.maze.map = {
        "#######",
        "#D.1.g#",
        "#####.#",
        "  #0..#",
        "  ###.#",
        "    #.#",
        "    ###",
    }

    cs.walker:SetPos(5, 5, 0)
    walker.state.life = 7

    return true
end


-- ////////////////////////////////////////////////////////////////////////////
-- ///
-- //
-- /
--      内部関数
--                                                                            /
--                                                                           //
--                                                                          ///
-- ////////////////////////////////////////////////////////////////////////////
