-- ////////////////////////////////////////////////////////////////////////////
-- ///
-- //
-- /
--      ロード時のテーブル設定
--                                                                            /
--                                                                           //
--                                                                          ///
-- ////////////////////////////////////////////////////////////////////////////

local GenMaze = import("Lib/GenMaze.lua")

-- stage(_G.stage)は初期化しないこと！(直前にWorldRule.luaのrule.QuestInit()で初期化しているため)
_G.stage_info = {}

-- ////////////////////////////////////////////////////////////////////////////
-- ///
-- //
-- /
--      説明,ヒント,解答など
--                                                                            /
--                                                                           //
--                                                                          ///
-- ////////////////////////////////////////////////////////////////////////////

stage_info._0_Title = "Stage01 アイテムを拾う/使う"

stage_info._1_StageRule = {
    "Walkerの行動可能は8",
    __rgui_folder_default_open = true,
}

stage_info._2_Hint = { '現在地に拾えるものがあるか？\n  map:CanPickup(0, 0)' }
stage_info._3_Hint = { 'アイテムを拾う\n  "Pickup"', }
stage_info._4_Hint = { '指定地点のマップ文字を取得する\n  map:Get(x, y)' }
stage_info._5_Hint = { '現在地に台座(宝玉なし)があるか？\n  map:Get(0, 0) == "l"' }
stage_info._6_Hint = { 'そのアイテムを持っているか？\n  inv:IsExist("アイテム名")' }
stage_info._7_Hint = { 'アイテムを使う\n  "UseItem", "アイテム名"', }

-- ////////////////////////////////////////////////////////////////////////////
-- ///
-- //
-- /
--      ホストからCallされる関数
--                                                                            /
--                                                                           //
--                                                                          ///
-- ////////////////////////////////////////////////////////////////////////////

-- ============================================================================
-- 迷路生成
--
-- 戻り値 : true .... 正常終了(迷路ができたよ！遊べるかは知らんけど！)
--          false ... 異常終了
--
-- ※ホストからはプレイできる迷路が生成されているかどうかの判定を行っていない
--
stage.GenerateMaze = function(_seed)
    stage.maze.map = {
        "###",
        "#$#",
        "#.#",
        "#k#",
        "#.#",
        "#l#",
        "#.#",
        "#o#",
        "#.#",
        "#.#",
        "###",
    }

    cs.walker:SetPos(1, 9, 0)
    walker.state.life = 8

    return true
end


-- ////////////////////////////////////////////////////////////////////////////
-- ///
-- //
-- /
--      内部関数
--                                                                            /
--                                                                           //
--                                                                          ///
-- ////////////////////////////////////////////////////////////////////////////
